# Projeto 2 - Ciência dos Dados

Nome: Alexia Barbosa Pires

Nome: Ellen Coutinho Lião da Silva

___
Carregando algumas bibliotecas:

In [39]:
import os
import pathlib
import pandas as pd

In [40]:
print('Esperamos trabalhar no diretório')
print(os.getcwd())

Esperamos trabalhar no diretório
C:\Users\ellen\Downloads\cdados_p2\22-2b-cd-p2-ellen_alexia

O projeto visa prever como se comportará, quantitativamente, a continuidade da educação primária para o sexo feminino e para o sexo masculino. 
Espaço para descrever cada variável que aparece no excel. 
Carregando a base de dados:

A base de dados é composta pelas seguintes targets:
- Country Name: nome do país 
- Country Code: identificador do país
- Anos de 1970 a 2021: razão entre a quantidade de novas matrículas na última classe do ensino primário com os alunos vigentes.
- Region: continente onde o país está localizado
- IncomeGroup: faixa de renda do país
- SpecialNotes: detalhe específico do país que foi considerado relevante para a análise

In [41]:
homens = pd.read_excel('data\homens.xls', sheet_name='Data')
homens.head(2)

,Country Name,Country Code,1970,1971,1972,1973,1974,1975,1976,1977,...,2012,2013,2014,2015,2016,2017,2018,2019,2020,2021
0,Aruba,ABW,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,92.037788,100.81855,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Africa Eastern and Southern,AFE,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [42]:
mulheres = pd.read_excel('data\mulheres.xls', sheet_name='Data')
mulheres.head(2)

,Country Name,Country Code,1970,1971,1972,1973,1974,1975,1976,1977,...,2012,2013,2014,2015,2016,2017,2018,2019,2020,2021
0,Aruba,ABW,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,101.255234,101.55587,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Africa Eastern and Southern,AFE,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

No mesmo arquivo excel, consta diferentes planilhas. A seguir, é feito o tratamento para que as targets acima esclarecidas estejam condensadas no mesmo espaço, para fins de organização.

In [48]:
# Organização do dataframe com dados referentes ao público masculino
mulheres_plus = pd.read_excel('data\mulheres.xls', sheet_name='Metadata - Countries')
mulheres['Region'] = mulheres_plus['Region']
mulheres['IncomeGroup'] = mulheres_plus['IncomeGroup']
mulheres['SpecialNotes'] = mulheres_plus['SpecialNotes']

# Organização do dataframe com dados referentes ao público masculino
homens_plus = pd.read_excel('data\homens.xls', sheet_name='Metadata - Countries')
homens['Region'] = homens_plus['Region']
homens['IncomeGroup'] = homens_plus['IncomeGroup']
homens['SpecialNotes'] = homens_plus['SpecialNotes']

lista_ambos = [mulheres, homens] #Lista útil para quando um mesmo procedimento for válido para ambos os dataframes

O próximo passo é definir para o Python quem são as variáveis qualitativas (IncomeGroup - aula 2) e quem são as variáveis quantitativas